[
  {
    "title": "Chocolate Chip Cookies",
    "description": "This recipe makes approximately 24 cookies and is perfect for anyone with a sweet tooth. The cookies are soft, chewy, and packed with chocolatey goodness.",
    "ingredients": [
      {
        "name": "White sugar",
        "amount": "340 grams"
      },
      {
        "name": "Light brown sugar",
        "amount": "255 grams"
      },
      {
        "name": "Butter, melted and cooled",
        "amount": "340 grams"
      },
      {
        "name": "All-purpose flour",
        "amount": "620 grams"
      },
      {
        "name": "Salt",
        "amount": "1.5 teaspoons"
      },
      {
        "name": "Baking powder",
        "amount": "1 teaspoon"
      },
      {
        "name": "Baking soda",
        "amount": "1 teaspoon"
      },
      {
        "name": "Vanilla bean",
        "amount": "1"
      },
      {
        "name": "Eggs",
        "amount": "2"
      },
      {
        "name": "Egg yolks",
        "amount": "2"
      },
      {
        "name": "High-quality semi-sweet chocolate",
        "amount": "454 grams"
      },
      {
        "name": "Pecans, chopped",
        "amount": "300 grams"
      },
      {
        "name": "Cane sugar",
        "amount": "150 grams"
      },
      {
        "name": "Water",
        "amount": "150 grams"
      },
      {
        "name": "Maldon Sea Salt, smoked",
        "amount": "as needed"
      }
    ],
    "steps": "1. Slowly heat up the 150 grams of cane sugar and 150 grams of water for about 10 minutes until it reaches 240 degrees Celsius. Add the pecans and stir until the sugar crystallizes. Continue to stir until the sugar melts again and coats the pecans. Spread the pecans on a sheet pan and bake at 175 degrees Celsius for 10 minutes. Let cool and chop into small pieces. \n2. Melt butter and smoke it according to the description above. Make sure to cool to room temperature before mixing batter. While you’re at it, smoke the Maldon Sea Salt as well. \n3. Combine baking powder, baking soda, salt and flour in a bowl. Whisk together to evenly distribute the leavening. \n4. In the bowl of a standing mixer, combine both sugars with the cooled melted butter. Mix on low speed with the paddle attachment until fully combined. \n5. Add eggs, yolks and vanilla and mix until combined. \n6. Add the dry ingredients in two or three additions. Mix only until the dry ingredients are incorporated. Add chocolate pieces and mix just until spread throughout. \n7. Using a 3-ounce scoop, scoop the dough onto a parchment-lined cookie sheet. Chill, or even better freeze for 24 hours, on the sheet or transfer to a freezer bag for longer-term storage. \n8. To bake: Preheat oven to 150 degrees Celsius. \n9. Place frozen scooped cookies onto a parchment-lined sheet pan with at least two inches of space all around them. \n10. Top with smoked Maldon Sea Salt. \n11. Bake until golden brown, and the center of the cookie looks set and no longer wet. About 23-28 minutes for 85-gram frozen dough balls. Less baking time will be needed if baking from refrigerated, fresh or smaller-sized cookies.",
    "image": "https://static01.nyt.com/images/2022/02/12/dining/JT-Chocolate-Chip-Cookies/JT-Chocolate-Chip-Cookies-articleLarge.jpg",
    "cuisine": "American"
  },
  {
    "title": "Apple Pie",
    "description": "This classic apple pie recipe is the perfect dessert for any occasion. The buttery crust and sweet, spiced apple filling will leave your taste buds happy.",
    "ingredients": [
      {
        "name": "All-purpose flour",
        "amount": "313 grams"
      },
      {
        "name": "Kosher salt",
        "amount": "1 teaspoon"
      },
      {
        "name": "Granulated sugar",
        "amount": "13 grams"
      },
      {
        "name": "Unsalted butter, chilled and cut into pieces",
        "amount": "227 grams"
      },
      {
        "name": "Mixed apples, peeled, cored, and cut into 1/2-inch thick slices",
        "amount": "1134 grams"
      },
      {
        "name": "Granulated sugar",
        "amount": "50 grams"
      },
      {
        "name": "Light brown sugar, packed",
        "amount": "50 grams"
      },
      {
        "name": "Fresh lemon juice",
        "amount": "30 milliliters"
      },
      {
        "name": "Kosher salt",
        "amount": "1/4 teaspoon"
      },
      {
        "name": "Ground cinnamon",
        "amount": "1/4 teaspoon"
      },
      {
        "name": "Cornstarch",
        "amount": "22 grams"
      },
      {
        "name": "Large egg, beaten",
        "amount": "1"
      },
      {
        "name": "Raw sugar",
        "amount": "15 grams"
      }
    ],
    "steps": "1. In a large bowl, whisk together the flour, salt, and sugar. Add the chilled butter and use a pastry blender or your fingers to cut the butter into the flour mixture until the mixture resembles coarse crumbs. \n2. Gradually add ice water, 1 tablespoon at a time, mixing until the dough comes together. Divide the dough in half and shape each half into a disk. Wrap in plastic wrap and refrigerate for at least 1 hour. \n3. Preheat the oven to 375°F. \n4. In a large bowl, toss the sliced apples with the granulated sugar, brown sugar, lemon juice, salt, cinnamon, and cornstarch. \n5. Roll out one disk of dough on a lightly floured surface to fit a 9-inch pie dish. Transfer the dough to the pie dish and trim the edges. \n6. Add the apple mixture to the pie dish. \n7. Roll out the second disk of dough on a lightly floured surface and cut into strips. Place the strips over the filling in a lattice pattern. \n8. Brush the beaten egg over the lattice crust and sprinkle with raw sugar. \n9. Bake for 45-50 minutes, or until the crust is golden brown and the filling is bubbly. \n10. Let cool for at least 30 minutes before serving.",
    "image": "https://images-gmi-pmc.edge-generalmills.com/27afbc3d-a14f-4ae0-bda4-97bf0a7d12a1.jpg",
    "cuisine": "American"
  },
  {
    "title": "Blueberry Galette",
    "description": "This rustic blueberry galette is a delicious dessert perfect for any occasion. The buttery crust and sweet blueberry filling will leave your taste buds happy.",
    "ingredients": [
      {
        "name": "All-purpose flour",
        "amount": "1 1/4 cups"
      },
      {
        "name": "Granulated sugar",
        "amount": "1 tablespoon"
      },
      {
        "name": "Kosher salt",
        "amount": "1/4 teaspoon"
      },
      {
        "name": "Unsalted butter, chilled and cut into pieces",
        "amount": "1/2 cup (1 stick)"
      },
      {
        "name": "Blueberries",
        "amount": "2 cups"
      },
      {
        "name": "Granulated sugar",
        "amount": "2 tablespoons"
      },
      {
        "name": "Cornstarch",
        "amount": "1 tablespoon"
      },
      {
        "name": "Fresh lemon juice",
        "amount": "1 tablespoon"
      },
      {
        "name": "Finely grated lemon zest",
        "amount": "1 teaspoon"
      },
      {
        "name": "Large egg, beaten",
        "amount": "1"
      },
      {
        "name": "Raw sugar",
        "amount": "1 tablespoon"
      }
    ],
    "steps": "1. In a food processor, pulse the flour, sugar, and salt until combined. Add the chilled butter and pulse until the mixture resembles coarse meal with a few pea-size pieces of butter remaining. \n2. Transfer the mixture to a large bowl. Drizzle with 1/4 cup ice water and mix with a fork, adding more ice water by the tablespoonful as needed, just until a shaggy dough comes together. Lightly knead until no dry spots remain (do not overwork). \n3. Flatten the dough into a disk and wrap in plastic. Chill for at least 2 hours. \n4. Preheat the oven to 400°F and place a rack in the lower third of the oven. \n5. In a large bowl, toss the blueberries, sugar, cornstarch, lemon juice, and lemon zest. \n6. On a lightly floured surface, roll out the dough into a 12-inch circle. Transfer the dough to a parchment-lined baking sheet. \n7. Arrange the blueberry mixture in the center of the dough, leaving a 2-inch border. \n8. Fold the edges of the dough over the filling, pleating as necessary. \n9. Brush the beaten egg over the edges of the dough and sprinkle with raw sugar. \n10. Bake for 35-40 minutes, or until the crust is golden brown and the filling is bubbling. \n11. Let cool for at least 10 minutes before serving.",
    "image": "https://preppykitchen.com/wp-content/uploads/2021/07/Blueberry-Galette-Recipe-n.jpg",
    "cuisine": "American"
  }
]
